INSERT INTO
    genres (name)
VALUES
    ('Рок'),
    ('Поп'),
    ('Электросвинг');

INSERT INTO
    artists (name)
VALUES
    ('Исполнитель 1'),
    ('Исполнитель 2'),
    ('Исполнитель 3'),
    ('Исполнитель 4');

INSERT INTO
    albums (title, year)
VALUES
    ('Альбом 1', '2020-01-01'),
    ('Альбом 2', '2020-02-01'),
    ('Альбом 3', '2020-03-01');

INSERT INTO
    tracks (id_album, duration)
VALUES
    (1, '00:03:00'),
    (1, '00:04:00'),
    (1, '00:05:00'),
    (2, '00:06:00'),
    (2, '00:07:00'),
    (2, '00:08:00');

INSERT INTO
    songbooks (title, year)
VALUES
    ('Сборник 1', '2020-01-01'),
    ('Сборник 2', '2020-02-01'),
    ('Сборник 3', '2020-03-01'),
    ('Сборник 4', '2020-04-01');

INSERT INTO
    artist_genres (id_artist, id_genre)
VALUES
    (1, 1),
    (1, 2),
    (1, 3),
    (2, 1),
    (2, 2),
    (2, 3),
    (3, 1),
    (3, 2),
    (3, 3),
    (4, 1),
    (4, 2),
    (4, 3),
    (1, 1),
    (1, 2),
    (1, 3),
    (2, 1),
    (2, 2),
    (2, 3),
    (3, 1),
    (3, 2),
    (3, 3),
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4);
